
[
    {"text": "Neste trabalho é apresentado uma avaliação de desempenho das plataformas de portabilidade PVM e MPI quando executados em um sistema distribuído e em uma máquina paralela SP2. Essa análise é feita através do desenvolvimento de vários algoritmos paralelos de ordenação, utilizando-se quatro implementações: IBM MPI, IBM PVMe (executadas no SP2), MPICH e PVM (executadas no sistema distribuído). Baseando-se na execução de algoritmos paralelos, apresenta-se uma comparação entre o comportamento dessas plataformas em cada tipo de arquitetura e em cada algoritmo implementado e uma comparação entre os diversos algoritmos de ordenação considerados. Os resultados obtidos com os algoritmos seqüenciais também são incluídos nesta avaliação, permitindo analisar o speedup alcançado com a execução das aplicações paralelas implementadas em cada plataforma. Através dos resultados obtidos foi possível constatar que realmente, conforme alguns autores citam mas não demonstram: o PVM apresenta melhor desempenho quando executado em sistemas distribuídos (visto que foi projetado especialmente para atuar sobre grupos de computadores autônomos interligados) e o MPI é mais adequado se implementado em arquiteturas paralelas."},
    {"text": "Esta dissertação de mestrado descreve a implementação de um módulo de simulação de redes de computadores para o ASiA (Ambiente de Simulação Automático). Este módulo permite ao usuário a simulação de redes já definidas (com a possibilidade de alteração dos parâmetros de entrada) ou definir novas redes através da utilização dos recursos da barra de ferramentas. Para aumentar a gama de sistemas que o usuário pode modelar foram implementados e incluídos na barra de ferramentas novas funcionalidades que permitem a modelagem de sistemas mais complexos. Este trabalho apresenta também uma revisão bibliográfica sobre simulação, redes de computadores e ambientes de simulação."},
    {"text": "Uma arquitetura para processamento paralelo baseada em um banco de transputers, foi desenvolvida e implementada com sucesso no LaSD (Laboratório de Sistemas Digitais) ICMSC-USP [TR91]. Essa arquitetura (SPP - Servidor de Processamento Paralelo) introduz recursos de processamento paralelo para os usuários de um sistema distribuído baseado em rede local de computadores. Neste trabalho são revisados alguns pontos básicos que ficaram pendentes na implementação original do software do SPP. Uma nova semântica de comunicação é implementada (\"at-least-once\") e os resultados obtidos na comparação com a semântica original (\"at-most-once\") são analisados. É apresentada uma nova implementação das primitivas de comunicação do SPP baseada na utilização do protocolo TCP/IP, visando maior abrangência no acesso remoto ao sistema. O trabalho discute as diretrizes básicas seguidas no projeto, implementação e os resultados obtidos nos testes efetuados."},
    {"text": "Os sistemas computacionais distribuídos aplicados à computação paralela permitem uma melhor relação custo/benefício para a computação paralela. Esses sistemas oferecem a potência computacional adequada às aplicações que não necessitam de uma máquina maciçamente paralela, porém necessitam de uma potência computacional maior que uma máquina seqüencial pode oferecer. P.V.M. (Parallel Virtual Machine) e M.P.I. (Message Passage Inteface) são exemplos de ambiente de paralelos virtuais amplamente discutidos na literatura. Tendo em vista a grande utilização desses ambientes tanto em nível acadêmico quanto em níveis comerciais e industriais, torna-se interessante a criação de uma ferramenta que apoie o desenvolvimento de programas para esses ambientes. Poucas são as ferramentas desse tipo que aparecem na literatura; uma delas e que permite ser estendida para dar suporte a tais ambientes é a F.A.P.P. (Ferramenta de Apoio à Programação Paralela). Dentro desse contexto, este trabalho apresenta a modelagem dos ambientes paralelos virtuais segundo a abordagem proposta na definição da F.A.P.P., para que arcabouços de programas P.V.M. e M.P.I. possam ser gerados. Essa ferramenta permite a utilização da computação paralela a um maior número de usuários, ou seja, auxiliando os iniciantes na confecção dos programa e os experientes na manutenção, além de permitir maior produtividade. Foram realizados estudos visando a validação e a avaliação da ferramenta. Os resultados obtidos demonstram que a ferramenta possui comportamento estável e tem potencial para ser utilizada livremente em ambientes P.V.M. e M.P.I.."},
    {"text": "O MPI é uma tentativa de padronização para ambientes de programação via troca de mensagens, tendo como objetivo portabilidade e eficiência em qualquer plataforma. O requisito de alta portabilidade sem perda de eficiência torna o MPI um padrão extenso. Rotinas de comunicação ponto a ponto, por exemplo, são estruturadas de várias maneiras, apresentando diferentes desempenhos. O objetivo deste trabalho é estudar o desempenho das rotinas de comunicação ponto a ponto do MPI em uma rede de computadores pessoais executando o sistema operacional LINUX, a fim de avaliar objetivamente a relação custo/benefício de cada uma. A avaliação é feita através da execução de benchmarks e um exemplo de aplicação, executados em três implementações de domínio público do MPI (MPICH, LAM e UNIFY), permitindo a comparação dessas implementações. Resultados obtidos com a utilização do PVM também são incluídos e comparados aos do MPI, visto que o PVM é uma plataforma de programação via troca de mensagens muito difundida na comunidade computacional. A apresentação clara e concisa dos aspectos fundamentais das diferentes formas de comunicação disponíveis em diferentes implementações do MPI e a avaliação de desempenho efetuada, que é capaz de orientar o usuário final na escolha de uma implementação do MPI, bem como da forma de comunicação mais adequada à sua aplicação, são contribuições importantes dessa dissertação."},
    {"text": "Este trabalho apresenta uma ferramenta de apoio ao desenvolvimento de aplicações distribuídas, baseadas em RPCs, para o ambiente Windows 95. Discute, ainda, algumas aplicações construídas para validar o sistema, as quais seguem o paradigma cliente servidor. É feita uma revisão bibliográfica dos assuntos mais relevantes relacionados ao tema e apresentados os detalhes de implementação da ferramenta. Esta foi implementada com técnicas de orientação a objetos, sendo composta por um Gerador Automático de Stubs e uma Biblioteca RPC, além de possibilitar a utilização de um Serviço de Binding. As aplicações construídas procuram explorar as potencialidades da ferramenta, sendo fornecidas também orientações gerais para o desenvolvimento de aplicações distribuídas no ambiente Windows 95."},
    {"text": "O objetivo principal deste trabalho é o desenvolvimento e avaliação de algoritmos numéricos paralelos e sua execução em máquinas paralelas (máquinas multiprocessadas, máquinas vetoriais e máquinas paralelas virtuais). Os algoritmos desenvolvidos foram executados em diferentes condições tanto em termos de plataformas utilizadas como em termos de tamanho da aplicação considerada. Os resultados obtidos na implementação dos algoritmos numéricos são analisados baseando-se em algumas métricas (tempo de execução e operações em ponto flutuante) comuns aos resultados apresentados nos principais benchmarks estudados. Através dos resultados obtidos, o desempenho das bibliotecas de passagem de mensagem MPI e PVM, o desempenho das arquiteturas consideradas e da implementação dos algoritmos numéricos são analisados."},
    {"text": "Os sistemas computacionais distribuídos aplicados à computação paralela permitem uma melhor relação custo/benefício para a computação paralela. Esses sistemas oferecem a potência computacional adequada às aplicações que não necessitam de uma máquina maciçamente paralela, porém necessitam de uma potência computacional maior que uma máquina seqüencial pode oferecer. PVM (Parallel Virtual Machine) é um exemplo de ambiente de passagem de mensagens, amplamente discutido na literatura, que permite a criação de máquinas paralelas virtuais em estações de trabalho, normalmente máquinas RISC, e com o sistema operacional UNIX. Dentro desse contexto, este trabalho descreve detalhadamente a implementação do PVMW95 (PVM para Windows95), um ambiente de passagem de mensagens que permite a criação de uma máquina paralela virtual, utilizando computadores pessoais conectados por uma rede de comunicação e com o sistema operacional Windows95, de modo análogo ao PVM. Foram realizados estudos preliminares visando a validação e a avaliação do desempenho do PVMW95. Os resultados obtidos demonstram que o ambiente tem comportamento estável e que as aplicações paralelas desenvolvidas apresentam um excelente speedup, considerando-se o hardware disponível."},
    {"text": "Esta dissertação de Mestrado apresenta uma extensão do ASiA (Ambiente de Simulação Automático), para simulação de arquiteturas de computadores, denominada Módulo Arquitetura. Este módulo possibilita que o usuário utilize arquiteturas já definidas(alterando ou não os seus parâmetros) ou desenvolva o modelo de uma nova arquitetura utilizando ferramentas específicas para simulação de arquitetura de computadores. Dois exemplos ilustram a utilização do Módulo Arquitetura, destacando as vantagens de sua aplicação tanto em ensino como em pesquisa. Este trabalho apresenta ainda algumas alterações efetuadas no ASiA para torná-lo mais amigável e flexível. Uma revisão bibliográfica dos assuntos relacionados ao tema é também apresentada."},
    {"text": "Este trabalho apresenta meios alternativos para a obtenção de imagens aéreas e sua utilização na agricultura. Imagens aéreas representam uma ferramenta importante na avaliação de diversos aspectos da atividade agrícola moderna, principalmente aqueles que não podem ser avaliados ao nível do solo. Três tipos de sistemas são definidos com níveis crescentes de complexidade e funcionalidade. Diversos critérios são propostos para a avaliação do sistema e para a determinação da sua adequação às principais aplicações na agricultura. Foi construído um protótipo de sistema do Tipo I baseado em aeromodelos que foi utilizado na avaliação da tecnologia e validação do projeto. Foram utilizados componentes facilmente encontrados no mercado, existindo potencial para a evolução técnica do sistema construído em cada um dos seus componentes básicos: a aeronave, o método de controle e o meio de captação das imagens. Os resultados obtidos mostram que o sistema pode substituir, a baixo custo, os meios convencionais utilizados até então para a obtenção dessas imagens."}
]