[
    {
     "text": "GADO HOLANDES\n tenho uma propriedade rural em mg estou iniciando a criaçao de gado de leite ja està em fase final a a construçao dos piquetes, foi me passado pelo embrapa um projeto de pasto rotativo e irrigado onde pode-se adotar uma medida de 80 m² por vaca por dia com o capim Tanzânia. Depois, faz-se ajustes nos piquetes conforme a necessidade.no meu caso estou formando os piquetes com capim TIFTON nesse caso seria a mesma medida de 80 M² por animal? e tambem ja estou negociando os animais mas como nao tenho muita experiencia estou na duvida entre  3/4 Holandes e PO Holandes qual raça seria a mais indicada para inicio da minha criaçao? "
    },
    {
     "text": "gado de leite\n  boa tarde . gostaria de saber ,qual a area(alqueres) de pasto nescessarios para cuidar de 15 vacas holandesas para leite (em media 15 litros dia). fora a ração . "
    },
    {
     "text": "pré-secado de alfafa \n Gostaria de saber se existe alguma dieta utilizando pré-secado de alfafa + cana com ureia e se presciso devo colocar concentrado em que proporção? "
    },
    {
     "text": "Intervalo ordenha \n Estou iniciando retirada de leite com ordenha e tenho duvida quanto ao intervalo entre uma ordenha e a próxima, ja ouvi falar que a vaca produz leite num intervalo de 12 em 12 horas, ou seja, se for tirar leite duas vezes por dia deveria ser a primeira as 6:00hr da manha e a segunda, no caso de duas tiradas por dia, as 18:00hr, se for tres vezes a cada 6 horas (6:00hr, 12:00hr, 18:00hr) , se for quatro tiradas, então a tirada seria a quada 3 horas (6:00hr, 9:00hr, 12hr, 15:00hr e 18:00hr). Esta correto? "
    },
    {
     "text": "Construções \n O Lava pés e o Pedelúvio são sempre depois da sala de ordenha? Eles não podem ser feitos entre a sala de espera e a sala de ordenha. Na sala de espera eu posso colocar um bebedouro? Veja o croqui que eu fiz com base no seu, conto com as suas críticas e sugestões. Muito obrigado! "
    },
    {
     "text": "Formula de suplementos para vacas em lactação \n Boa tarde, gostaria de saber, se voceis poderiam me passar algumas (formulas) para vacas em lactação, onde eu mesmo pudesse fazer, para baratear o preço.Sou pequeno produtor, o ano todo eu trato das vacas com cana, e na seca ajudo com silo de milho. Hoje eu bato uma ração sem nem uma base, faço a olho, tenho,farelo de soja e farelo de amendoim, milho e tambem sal mineral.Gostaria de saber para cada 100kl de ração preparada quanto usar de cada ingrediente? Vacas são media de 8 litros uma pela outra. Será que voceis poderiam me ajudar? Desde já agradeço, e espero respostas."
    },
    {
     "text": "Capim elefante pioneiro \n Venho através deste email solicitar informações sobre o 'Capim elefante Pioneiro' no qual andei lendo algumas notícias e notei ser um bom investimento para os criadores daqui da região em termos de melhoramento nutricional, gostaria de saber se esta nova variedade de capim se adaptaria a esta região e como eu posso adquirir amostras gratuitas para fazermos testes com elas aqui em nosso solo. Sabendo que há uma carência de um bom pasto para os animais daqui, tentamos melhorar cada vez mais a alimentação dos nossos rebanhos que no momento o foco é o gado de leite. Acredito nesta variedade de capim elefante visando a melhoria nutricional dos animais."
    },
    {
     "text": "Mini projeto para pasteurização e empacotamento do leite- 330lt/dia \n Estou querendo processar o leite,pasteurizar e empacotar, 300lt/dia, necessito de um mini projeto, mais simples, que atenda as necessidades básicas da vigilância sanitária. Estou localizado a 30 Km de Goiânia-GO. "
    },
    {
     "text": "FORMULAÇÃO DE RAÇÕES \n OLÁ, ESTOU INICIANDO UMA PEQUENA CRIAÇÃO DE VACAS PARA LEITE E GOSARIA DE SABER ALGUMAS FOMULAÇÕES DE RAÇÃO E AS QUANTIDADES QUE DEVO FORNECER AOS ANIMAIS. OS INGREDIENTES MAIS FACILMENTE ENCONTRADOS NA REGIÃO SÃO MILHO, RESÍDUO DE ALGODÃO, FARELO DE TRIGO E SOJA. A FAZENDA É SITUADA NO INTERIOR DO CEARÁ E TENHO UM PLANTIO DE CAPIM ELEFANTE NA FAZENDA. DESDE JÁ AGRADEÇO A ATENÇÃO."
    },
    {
     "text": "Como ter uma pastagem boa.\n Tenho 15 Halqueiras de terra no E. Santo, mas todo ano passo o maior sufoco para alimentar o gado tenho que alugar até pasto, quero reverter esta situação voces pode me orientar ou indicar alguem para esta situação."
    }
 ]
